using Encode2It.Core;

// Version Info
string[] versioninfo = [
    "v1.0",
    "Welcome to your new guide (encoder)!"
];

// Create new logger.
Logger logger = new("Main");

// Awesome banner
Console.WriteLine("-----------------------------------------------------------------------");
Console.WriteLine("""

███████╗███╗   ██╗ ██████╗ ██████╗ ██████╗ ███████╗██████╗ ██╗████████╗
██╔════╝████╗  ██║██╔════╝██╔═══██╗██╔══██╗██╔════╝╚════██╗██║╚══██╔══╝
█████╗  ██╔██╗ ██║██║     ██║   ██║██║  ██║█████╗   █████╔╝██║   ██║   
██╔══╝  ██║╚██╗██║██║     ██║   ██║██║  ██║██╔══╝  ██╔═══╝ ██║   ██║   
███████╗██║ ╚████║╚██████╗╚██████╔╝██████╔╝███████╗███████╗██║   ██║   
╚══════╝╚═╝  ╚═══╝ ╚═════╝ ╚═════╝ ╚═════╝ ╚══════╝╚══════╝╚═╝   ╚═╝   

""");
Console.WriteLine($"Version {versioninfo[0]} - {versioninfo[1]}");
Console.WriteLine("Made by PicelBoi");
Console.WriteLine("-----------------------------------------------------------------------");
Console.WriteLine("\n");

// Create config class.
Config config = new();
